In [2]:
import pandas as pd
df=pd.read_csv('Frequency Table.csv')
df.head()

   Student  Overall Marks Gender    Subject
0    Anish             97   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

## Frequency Table for catagorical values

In [3]:
frq = df['Subject'].value_counts()
frq

Chemistry    36
Physics      35
English      29
Name: Subject, dtype: int64